In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df=pd.read_csv('data_groupby.csv')
df

    value1  value2        day  color     name
0       12      15     monday    red     berk
1        4      16    tuesday    red  theresa
2        9      25  wednesday    red     john
3       15      65     monday  black    alina
4       23      55    tuesday  black    david
5       22      39  wednesday  black     mike
6       16      18     monday   blue     berk
7        8      47    tuesday   blue  theresa
8       62      64  wednesday   blue     john
9       19      81     monday  green    alina
10      21      92    tuesday  green    david
11      56      76  wednesday  green     mike

In [3]:
group1 = df['value1'].groupby(df['name'])

In [4]:
group1

In [5]:
group1.mean()

name
alina      17.0
berk       14.0
david      22.0
john       35.5
mike       39.0
theresa     6.0
Name: value1, dtype: float64

In [6]:
group1.sum()

name
alina      34
berk       28
david      44
john       71
mike       78
theresa    12
Name: value1, dtype: int64

In [7]:
group2 = df['value2'].groupby(df['color'])

In [8]:
group2.sum()

color
black    159
blue     129
green    249
red       56
Name: value2, dtype: int64

In [9]:
df.groupby('color').sum()

       value1  value2
color
black      60     159
blue       86     129
green      96     249
red        25      56

In [10]:
df.groupby(['color','name']).sum()

               value1  value2
color name
black alina        15      65
      david        23      55
      mike         22      39
blue  berk         16      18
      john         62      64
      theresa       8      47
green alina        19      81
      david        21      92
      mike         56      76
red   berk         12      15
      john          9      25
      theresa       4      16